//задача 9

/*1. Конструктор с параметрами, соответвующие способам задания объекта
и конструктор без параметров
2. методы доступа к полям класса (get, set)
3. методы реализующие указанные в задании операции.
4. метод toString, возвращающий информацию об объекте в виде строки.*/

/*Создать класс Date для работы с датами в формате
<год.месяц.день>. Дата представляется структурой с тремя
полями типа unsigned int: для года, месяца, и дня.
Класс должен включать не менее трех функций инициализации:
числами, строкой вида <год.месяц.день>
(например <2004.08.31>) и датой. Обязательными операциями
являются: вычисление даты через заданное количество дней,
вычитание заданного количества дней из даты,
определение високосности года, присвоение и получение отдельных частей
(год, месяц, день), сравнение дат (равно, до, после), вычисление количества
дней между датами.*/

#include "ClassDate.h"

int main() {
	start();
}